2020-02-25
Mastercard 4597 61** **** 2324 -> Visa 0264 84** **** 4307
Сумма: 17655.0 RUB
2020-06-07
Visa 6644 69** **** 6766 -> Mastercard 8548 96** **** 6541
Сумма: 12234.0 RUB
2021-02-19
Mastercard 9775 49** **** 9116 -> Discover 5944 50** **** 3459
Сумма: 12918.0 RUB
2022-02-08
Discover 6348 32** **** 5461 -> Mastercard 7325 94** **** 4710
Сумма: 15911.0 RUB
2020-02-06
Mastercard 7673 26** **** 9337 -> Discover 6961 58** **** 5561
Сумма: 12480.0 RUB
2021-06-20
American Express 2932 52** **** 4117 -> American Express 3633 64** **** 8444
Сумма: 19321.0 RUB
2022-06-09
Visa 4756 82** **** 5661 -> Discover 6499 54** **** 6238
Сумма: 30387.0 RUB
